---
permalink: encryption-at-rest/encrypt-existing-volume-task.html 
sidebar: sidebar 
keywords: enabling, encryption, existing, volume, volume move start, command 
summary: Vous pouvez utiliser la commande volume Move start pour activer le chiffrement en déplaçant un volume existant. Vous devez utiliser le déplacement de volume commençant par ONTAP 9.2 et les versions antérieures. Vous pouvez utiliser le même agrégat ou un autre agrégat. 
---
= Activez le chiffrement sur un volume existant à l'aide de la commande volume Move start
:allow-uri-read: 
:icons: font
:imagesdir: ../media/


[role="lead"]
Vous pouvez utiliser le `volume move start` commande permettant d'activer le chiffrement en déplaçant un volume existant. Vous devez utiliser `volume move start` Dans ONTAP 9.2 et versions antérieures. Vous pouvez utiliser le même agrégat ou un autre agrégat.

.Ce dont vous avez besoin
Vous devez être un administrateur de cluster pour effectuer cette tâche, ou un administrateur de SVM à qui l'administrateur du cluster a délégué des pouvoirs.

link:delegate-volume-encryption-svm-administrator-task.html["Délégation d'autorité pour exécuter la commande de déplacement de volume"]

.Description de la tâche
Vous pouvez utiliser ONTAP 9.8 depuis `volume move start` Pour activer le chiffrement sur un volume SnapLock ou FlexGroup.

Depuis ONTAP 9.4, si vous activez « cc-mode » lors de la configuration du gestionnaire de clés intégré, les volumes que vous créez avec le système `volume move start` la commande est automatiquement chiffrée. Vous n'avez pas besoin de spécifier `-encrypt-destination true`.

Depuis ONTAP 9.6, il est possible d'utiliser le chiffrement au niveau de l'agrégat pour attribuer des clés à l'agrégat contenant afin de déplacer les volumes. Un volume chiffré avec une clé unique est appelé un _volume NVE_. Un volume chiffré avec une clé au niveau de l'agrégat est appelé un volume NAE_ (pour le chiffrement d'agrégat NetApp). Les volumes en texte brut ne sont pas pris en charge dans les agrégats NAE.

.Étapes
. Déplacez un volume existant et spécifiez si le chiffrement est activé sur le volume :
+
[cols="35,65"]
|===


| Pour convertir... | Utilisez cette commande... 


 a| 
Volume en texte brut vers un volume NVE
 a| 
`volume move start -vserver SVM_name -volume volume_name -destination-aggregate aggregate_name -encrypt-destination true`



 a| 
Un volume NVE ou en texte clair vers un volume NAE (en supposant que le chiffrement au niveau de l'agrégat est activé sur la destination)
 a| 
`volume move start -vserver SVM_name -volume volume_name -destination-aggregate aggregate_name -encrypt-with-aggr-key true`



 a| 
Un volume NAE vers un volume NVE
 a| 
`volume move start -vserver SVM_name -volume volume_name -destination-aggregate aggregate_name -encrypt-with-aggr-key false`



 a| 
Volume NAE en volume en texte brut
 a| 
`volume move start -vserver SVM_name -volume volume_name -destination-aggregate aggregate_name -encrypt-destination false -encrypt-with-aggr-key false`



 a| 
Un volume NVE vers un volume en texte brut
 a| 
`volume move start -vserver SVM_name -volume volume_name -destination-aggregate aggregate_name -encrypt-destination false`

|===
+
Pour connaître la syntaxe complète de la commande, reportez-vous à la page man.

+
La commande suivante convertit un volume en texte brut nommé `vol1` Vers un volume NVE :

+
[listing]
----
cluster1::> volume move start -vserver vs1 -volume vol1 -destination-aggregate aggr2 -encrypt-destination true
----
+
En supposant que le chiffrement au niveau de l'agrégat soit activé sur la destination, la commande suivante convertit un volume NVE ou en texte brut nommé `vol1` Pour un volume NAE :

+
[listing]
----
cluster1::> volume move start -vserver vs1 -volume vol1 -destination-aggregate aggr2 -encrypt-with-aggr-key true
----
+
La commande suivante convertit un volume NAE nommé `vol2` Vers un volume NVE :

+
[listing]
----
cluster1::> volume move start -vserver vs1 -volume vol2 -destination-aggregate aggr2 -encrypt-with-aggr-key false
----
+
La commande suivante convertit un volume NAE nommé `vol2` vers un volume en texte clair :

+
[listing]
----
cluster1::> volume move start -vserver vs1 -volume vol2 -destination-aggregate aggr2 -encrypt-destination false -encrypt-with-aggr-key false
----
+
La commande suivante convertit un volume NVE nommé `vol2` vers un volume en texte clair :

+
[listing]
----
cluster1::> volume move start -vserver vs1 -volume vol2 -destination-aggregate aggr2 -encrypt-destination false
----
. Afficher le type de chiffrement des volumes du cluster :
+
`volume show -fields encryption-type none|volume|aggregate`

+
Le `encryption-type` Ce champ est disponible dans ONTAP 9.6 et versions ultérieures.

+
Pour connaître la syntaxe complète de la commande, reportez-vous à la page man.

+
La commande suivante affiche le type de cryptage des volumes dans `cluster2`:

+
[listing]
----
cluster2::> volume show -fields encryption-type

vserver  volume  encryption-type
-------  ------  ---------------
vs1      vol1    none
vs2      vol2    volume
vs3      vol3    aggregate
----
. Vérifiez que les volumes sont activés pour le chiffrement :
+
`volume show -is-encrypted true`

+
Pour connaître la syntaxe complète de la commande, reportez-vous à la page man.

+
La commande suivante affiche les volumes chiffrés sur `cluster2`:

+
[listing]
----
cluster2::> volume show -is-encrypted true

Vserver  Volume  Aggregate  State  Type  Size  Available  Used
-------  ------  ---------  -----  ----  -----  --------- ----
vs1      vol1    aggr2     online    RW  200GB    160.0GB  20%
----


.Résultat
Si vous utilisez un serveur KMIP pour stocker les clés de cryptage d'un nœud, ONTAP « transfère » automatiquement une clé de cryptage vers le serveur lorsque vous chiffrez un volume.
