---
permalink: flexgroup/shrink-flexgroup-volume-task.html 
sidebar: sidebar 
keywords: reduce, size, flexgroup, volume, flex group, resize, shrink, shrinking, autosize 
summary: 'Depuis ONTAP 9.6, vous pouvez redimensionner un volume FlexGroup à une valeur inférieure à sa taille actuelle afin de libérer l"espace inutilisé du volume. Si vous réduisez la taille d"un volume FlexGroup, ONTAP redimensionne automatiquement tous les composants FlexGroup.' 
---
= Réduction de la taille des volumes ONTAP FlexGroup
:allow-uri-read: 
:icons: font
:imagesdir: ../media/


[role="lead"]
Depuis ONTAP 9.6, vous pouvez redimensionner un volume FlexGroup à une valeur inférieure à sa taille actuelle afin de libérer l'espace inutilisé du volume. Si vous réduisez la taille d'un volume FlexGroup, ONTAP redimensionne automatiquement tous les composants FlexGroup.

.Étape
. Vérifiez la taille actuelle du volume FlexGroup : 'taille du volume -vserver _vserver_name_ -volume _fg_name_'
. Réduire la taille du volume FlexGroup : `volume size -vserver _vserver_name_ -volume _fg_name_ _new_size_`
+
Lorsque vous spécifiez la nouvelle taille, vous pouvez spécifier une valeur inférieure à la taille actuelle ou une valeur négative à l'aide du signe moins (-) par lequel la taille actuelle du volume FlexGroup est réduite.

+
[NOTE]
====
Si la réduction automatique est activée pour le volume (`volume autosize` commande), la taille automatique minimale est définie sur la nouvelle taille du volume.

====
+
L'exemple suivant affiche la taille actuelle du volume FlexGroup nommé Volx et redimensionne le volume à 10 To :

+
[listing]
----
cluster1::> volume size -vserver svm1 -volume volX
(volume size)
vol size: FlexGroup volume 'svm1:volX' has size 15TB.

cluster1::> volume size -vserver svm1 -volume volX 10TB
(volume size)
vol size: FlexGroup volume 'svm1:volX' size set to 10TB.
----
+
L'exemple suivant affiche la taille actuelle du volume FlexGroup nommé Volx et réduit la taille du volume de 5 To :

+
[listing]
----
cluster1::> volume size -vserver svm1 -volume volX
(volume size)
vol size: FlexGroup volume 'svm1:volX' has size 15TB.

cluster1::> volume size -vserver svm1 -volume volX -5TB
(volume size)
vol size: FlexGroup volume 'svm1:volX' size set to 10TB.
----

